import { Box, Grid, Button, Typography } from '@mui/material';
import { useNavigate } from 'react-router';
import { DashboardIconComponent } from 'assets/icons';

function Dashboard(): React$Node {
  const navigate = useNavigate();

  return (
    <Box component={'section'}>
      <Grid
        container
        spacing={8}
        rowSpacing={5}
        sx={{
          margin: 'auto',
        }}
      >
        <Grid item lg={6} xs={0}>
          <DashboardIconComponent />
        </Grid>
        <Grid
          item
          lg={6}
          xs={12}
          sx={{
            textAlign: { xs: 'center', lg: 'right' },
          }}
        >
          <Typography
            variant={'h1'}
            component={'div'}
            sx={{ lineHeight: 2, overflow: 'visible' }}
          >
            {'یوزربانک!'}
          </Typography>
          <Typography
            component={'p'}
            sx={{ 
              lineHeight: 2,
              overflow: 'visible',
              padding: { xs: '0 2rem', lg: '0 0 0 10rem' },
            }}
          >
            {
              'لورم ایپسوم نام یک نوع متن متداول نگهدارنده فضا در صفحات وب است. از آن با عنوان متن ساختگی یا متن پرکننده نیز یاد می‌کنند. از طریق کپی – پیست کردن متن لورم ایپسوم، فضایی مشخص در گوشه‌ای از یک صفحه وب را پر می‌کنیم، بدون این که مطلبی ارزشمند یا حتی معنادار در آنجا نوشته باشیم. با خواندن متن لورم ایپسوم خیلی زود متوجه مهمل بودن آن خواهید شد، اما در هر صورت، ایده‌ای از ظاهر نهایی وب سایت بعد از پر شدن آن با محتواهای واقعی، به کاربر می‌دهد.'
            }
            {
              'لورم ایپسوم نام یک نوع متن متداول نگهدارنده فضا در صفحات وب است. از آن با عنوان متن ساختگی یا متن پرکننده نیز یاد می‌کنند. از طریق کپی – پیست کردن متن لورم ایپسوم، فضایی مشخص در گوشه‌ای از یک صفحه وب را پر می‌کنیم، بدون این که مطلبی ارزشمند یا حتی معنادار در آنجا نوشته باشیم. با خواندن متن لورم ایپسوم خیلی زود متوجه مهمل بودن آن خواهید شد، اما در هر صورت، ایده‌ای از ظاهر نهایی وب سایت بعد از پر شدن آن با محتواهای واقعی، به کاربر می‌دهد.'
            }
            {
              'لورم ایپسوم نام یک نوع متن متداول نگهدارنده فضا در صفحات وب است. از آن با عنوان متن ساختگی یا متن پرکننده نیز یاد می‌کنند. از طریق کپی – پیست کردن متن لورم ایپسوم، فضایی مشخص در گوشه‌ای از یک صفحه وب را پر می‌کنیم، بدون این که مطلبی ارزشمند یا حتی معنادار در آنجا نوشته باشیم. با خواندن متن لورم ایپسوم خیلی زود متوجه مهمل بودن آن خواهید شد، اما در هر صورت، ایده‌ای از ظاهر نهایی وب سایت بعد از پر شدن آن با محتواهای واقعی، به کاربر می‌دهد.'
            }
            {
              'لورم ایپسوم نام یک نوع متن متداول نگهدارنده فضا در صفحات وب است. از آن با عنوان متن ساختگی یا متن پرکننده نیز یاد می‌کنند. از طریق کپی – پیست کردن متن لورم ایپسوم، فضایی مشخص در گوشه‌ای از یک صفحه وب را پر می‌کنیم، بدون این که مطلبی ارزشمند یا حتی معنادار در آنجا نوشته باشیم. با خواندن متن لورم ایپسوم خیلی زود متوجه مهمل بودن آن خواهید شد، اما در هر صورت، ایده‌ای از ظاهر نهایی وب سایت بعد از پر شدن آن با محتواهای واقعی، به کاربر می‌دهد.'
            }
          </Typography>
          <Button
            type={'button'}
            onClick={() => navigate('../userList')}
            sx={{ width: 200, mt: '1rem' }}
            variant={'contained'}
            color={'success'}
          >
            {'شروع کنید'}
          </Button>
        </Grid>
      </Grid>
    </Box>
  );
}

export default Dashboard;
